######
# Taps
######

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

###########
# Libraries
###########

# Library to parse XMP metadata
brew "exempi"

# Software library to render fonts
brew "freetype"

# Image manipulation library
brew "jpeg"

# C and C++ client library to the memcached server
brew "libmemcached"

# Library for manipulating PNG images
brew "libpng"

# C implementation of a Sass compiler
brew "libsass"

# PCRE (Perl Compatible RegEx)
brew "pcre"

# Library for command-line editing
brew "readline"

# TIFF library and utilities
brew "libtiff"

# Image format providing lossless and lossy compression for web images
brew "webp"

# General-purpose lossless data-compression library
brew "zlib"

######
# Apps
######

# Search tool like grep, but optimized for programmers
brew "ack"

# Graphical system information display for macOS
brew "archey"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# Monitor a directory for changes and run a shell command
brew "fswatch"

# GIF image/animation creator/editor
brew "gifsicle"

# Distributed revision control system
brew "git"

# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# Text-to-HTML conversion tool
brew "markdown"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Python version management
brew "pyenv"

# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

# Perl-powered file rename script with many helpful built-ins
brew "rename"

# Wrapper around libsass that helps to create command-line apps
brew "sassc"

# Command-line interface for SQLite
brew "sqlite"

# CLI tool that moves files or folder to the trash
brew "trash"

# Display directories as trees (with optional color/HTML output)
brew "tree"

#######################
# Specific Version Apps
#######################

# Open source relational database management system
brew "mysql@5.7"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"


#######
# Casks
#######

cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "chromedriver"
cask "db-browser-for-sqlite"
